chore: updates mermaid diagrams
